import os
import time


def type_writer(text, delay=0.002):
    for char in text:
        print(char, end='', flush=True)
        time.sleep(delay)
    print()


ascii_header = r"""
                         █████╗ ███╗   ███╗ █████╗ ███████╗██╗███╗   ██╗ ██████╗ 
                        ██╔══██╗████╗ ████║██╔══██╗╚══███╔╝██║████╗  ██║██╔════╝ 
                        ███████║██╔████╔██║███████║  ███╔╝ ██║██╔██╗ ██║██║  ███╗
                        ██╔══██║██║╚██╔╝██║██╔══██║ ███╔╝  ██║██║╚██╗██║██║   ██║
                        ██║  ██║██║ ╚═╝ ██║██║  ██║███████╗██║██║ ╚████║╚██████╔╝
                        ╚═╝  ╚═╝╚═╝     ╚═╝╚═╝  ╚═╝╚══════╝╚═╝╚═╝  ╚═══╝ ╚═════╝               


                                    CREATED BY YAIT-OUG & ILHAKAM

"""

intro_lines = [
    "Welcome to the AMAZING PROJECT!",
    "Prepare to witness something extraordinary...",
    "Ideas come alive here, and innovation has no limits.",
    "Let’s embark on this incredible journey together!\n",
    "Loading features...",
    "READY 🚀"
]

def show_header() -> None:
    os.system("clear")    
    for line in ascii_header.split("\n"):
        type_writer(line)
    for line in intro_lines:
        type_writer(line, 0.03)
    

show_header()
